"""
1).หาค่าสูงสุดอันดับ 2 ใน array
-ถ้ามีเลขซ้ำ?
-ถ้ามีน้อยกว่า 2 ตัว?
2).ตรวจสอบว่า string เป็น palindrome
-ต้องสนใจตัวพิมพ์ใหญ่/เล็กไหม?
-ช่องว่าง / เครื่องหมายพิเศษนับไหม?
3).นับจำนวนคำในประโยค
-ถ้ามีช่องว่างติดกัน?
-ถ้ามีขึ้นบรรทัดใหม่?
"""

"""
สร้างตัวแปรเริ่มต้น Ans = 0 ขึ้นมา
เอาตัวเลขเเรกออกมา array[0]
สร้างลูปวนเช็คทีละตัว ถ้ามากกว่าหรือเท่ากับ ให้เขียนทับ A = list[n] ถ้าน้อยกว่าให้ไม่ต้องทำอะไรเลย
"""

#--------------------------------ข้อ 1 -----------------------------------
Quest1 = [213,21312,213,2,3,41,23,41,2,32,25,512,1,51242,12,23,412.123,]
ans = 0
n = 0
for i in range(len(Quest1)):
    print(Quest1[n])
    if Quest1[n] >= ans:
        ans = Quest1[n]
    n += 1
print("------------------------------")
print(f"The Highest number in array : {Quest1}\nis {ans}")
#------------------------------------------------------------------------

"""
แก้ได้หลายวิธี
1. วิธี "พับครึ่ง" (The Mirror Method) (กระดาษพับครึ่ง)
ขั้นตอน: 1. หาจุดกึ่งกลางของคำ 2. เทียบตัวแรกกับตัวสุดท้าย 3. เทียบตัวที่สองกับตัวรองสุดท้าย 4. ไล่เข้ามาเรื่อยๆ จนถึงตรงกลาง

2. วิธี "เขียนย้อนกลับ" (The Reverse Method) (กระจก)
ขั้นตอน: 1. นำคำต้นฉบับมาเขียนใหม่จากหลังมาหน้า 2.นำคำที่เขียนใหม่ไปวางทาบกับคำเดิม 3.เหมือน = ใช่

3. วิธี "ลบหัว-ท้าย" (The Peel Method) (ปอกหัวหอม)
ขั้นตอน: 1. ดูตัวอักษร "ซ้ายสุด" และ "ขวาสุด" 2. ถ้าเหมือนกัน ให้ ตัดทิ้ง ทั้งคู่ 3. ทำซ้ำกับส่วนที่เหลือ ถ้าไม่เหลือ = ใช่
"""

#--------------------------------ข้อ 2 -----------------------------------
Quest2 = ["ksadjn", "lskadjow", "lsadi", "asdsa", "sadssas", "iutyui"]
all_palindrome = []
for word in Quest2:
    # วิธีกลับด้านตัวอักษรที่ง่ายที่สุดใน Python คือ [::-1]
    reversed_word = word[::-1] 
    
    # เทียบคำเดิม กับ คำที่กลับด้านแล้ว
    if word == reversed_word:
        all_palindrome.append(word)

print(all_palindrome) 
# ผลลัพธ์จะเป็น: ['asdsa']
#------------------------------------------------------------------------

"""
เป้าหมายคือการนับว่าใน 1 ประโยค มีคำทั้งหมดกี่คำ
Input: รับข้อความเข้ามา 1 ประโยค (เช่น "I love Python programming")
สังเกตตัวแบ่ง: โดยปกติ "ช่องว่าง" (Space) คือสิ่งที่ใช้แยกแต่ละคำออกจากกัน
ดูประโยคตั้งแต่ต้นจนจบ
เมื่อเจอช่องว่าง ให้ถือว่าจบ 1 คำ
หรือใช้วิธี "ตัด" ประโยคตามช่องว่างที่มี แล้วเอาคำที่ถูกตัดออกมาวางเป็นกองๆ
Output: นับจำนวนกองคำที่ได้ทั้งหมด แล้วแสดงผลเป็นตัวเลข
"""


#--------------------------------ข้อ 3 -----------------------------------
sentence = "Python programming"

# 1. ตัดประโยคออกเป็น List ของคำ โดยใช้ช่องว่างเป็นเกณฑ์
words_list = sentence.split() 

# 2. นับจำนวนสมาชิกใน List นั้น
word_count = len(words_list)

print(f"จำนวนคำในประโยคคือ: {word_count} คำ")
# ผลลัพธ์: 2 คำ
#------------------------------------------------------------------------